Catalogs/Сертификаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Сертификаты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСертификата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСертификата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоминалПогашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сертификаты/Ext/ManagerModule.bsl
//
  //
   Процедура СоздатьЗаписьВСправочнике(CODE, TYPE, SUM, ACTIVE, DISCOUNT, PASSWORD, СтрАнализа) Экспорт 
	          		   
	   Запрос = Новый Запрос;
	   Запрос.УстановитьПараметр("КодСертификата", CODE);	   
	   Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	   |	Сертификаты.Ссылка
	   |ИЗ
	   |	Справочник.Сертификаты КАК Сертификаты
	   |ГДЕ
	   |	Сертификаты.КодСертификата = &КодСертификата";
	   
	   Результат =  Запрос.Выполнить();  
	   Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	   
	   Если Выборка.Следующий() Тогда
		   НовыйСправочник = Выборка.Ссылка.ПолучитьОбъект();
	   Иначе
		   НовыйСправочник  = Справочники.Сертификаты.СоздатьЭлемент();
		   НовыйСправочник.УстановитьНовыйКод();
		   НовыйСправочник.Наименование = "№" + CODE; 
		   НовыйСправочник.КодСертификата = CODE;
		   СтрАнализа.Новых  =  СтрАнализа.Новых + 1;
	   КонецЕсли;
  	   
	   НовыйСправочник.ВидСертификата = Справочники.ВидыСертификатов.НайтиЭлементВСправочнике(TYPE);   
	   НовыйСправочник.ДисконтнаяКарта = Справочники.ИнформационныеКарты.НайтиЭлементВСправочнике(DISCOUNT);           
	   НовыйСправочник.Актуальность = ACTIVE;                              
	   НовыйСправочник.Пароль  = PASSWORD;
	   НовыйСправочник.Сумма = SUM;	  
	   
	   Попытка 
		   НовыйСправочник.ОбменДанными.Загрузка = Истина;
		   НовыйСправочник.Записать();
	   Исключение
		   //ошибка = ОписаниеОшибки();
	   КонецПопытки;	
	   
  КонецПроцедуры
